# data-database-types-relational-language-SQL-MySQL-C_R_UD-read-command-SELECT-WHERE-operator-AND-OR
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

```sql
mysql> use lab1;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab1 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------+------+------+------------+-----------+
| personID | name  | age  | sex  | dob        | isStudent |
+----------+-------+------+------+------------+-----------+
|        1 | John  |   23 | M    | 2000-01-01 |         1 |
|        2 | Tom   |   64 | M    | 1958-03-11 |         0 |
|        3 | Mary  |   12 | F    | 2005-04-11 |         1 |
|        4 | Alan  |   12 | M    | 2005-11-21 |         1 |
|        5 | Pat   |   29 | M    | 1993-03-17 |         0 |
|        6 | Shane |   40 | M    | 1988-07-21 |         0 |
|        7 | Shane |   14 | M    | 2003-06-01 |         1 |
|        8 | Alice |   24 | F    | 1999-03-01 |         1 |
|        9 | Pat   |   37 | F    | 1988-04-15 |         0 |
+----------+-------+------+------+------------+-----------+
9 rows in set (0.00 sec)
```

```sql
mysql> describe person;
+-----------+---------------+------+-----+---------+----------------+
| Field     | Type          | Null | Key | Default | Extra          |
+-----------+---------------+------+-----+---------+----------------+
| personID  | int           | NO   | PRI | NULL    | auto_increment |
| name      | varchar(20)   | NO   |     | NULL    |                |
| age       | int           | YES  |     | NULL    |                |
| sex       | enum('M','F') | YES  |     | M       |                |
| dob       | date          | YES  |     | NULL    |                |
| isStudent | tinyint(1)    | YES  |     | NULL    |                |
+-----------+---------------+------+-----+---------+----------------+
6 rows in set (0.00 sec)
```

- returned rows - records - tuples - from column - attribute - field - name - claus - WHERE - column - attribute - field - isStudent - value one - True - operator - AND - claus - WHERE - column - attribute - field - sex - value - M - male [1]

```sql
mysql> SELECT name
    -> FROM person
    -> WHERE isStudent
    -> AND sex="M";
+-------+
| name  |
+-------+
| John  |
| Alan  |
| Shane |
+-------+
3 rows in set (0.00 sec)
```

- returned rows - records - tuples - from columns - attributes - fields - name - age - claus - WHERE - column - attribute - field - sex - value - M - operator - AND - column - attribute - field - name - begins with letter - S - operator - OR - column - attribute - field - name - begins with letter - A - returned row - record - tuple - value - Alice - albeit female - **operator** **precedence** - **order** of **execution** - operator - **AND** - has a **higher** **precedence** over - **OR** - query match any row - record - tuple - where the condition 1 - operator - OR condition 2 is met [1]

```sql
-- condition 1
WHERE sex="M"
AND name LIKE "S%"
```

```sql
-- condition 2
OR name LIKE "A%"
```

- condition 1 - column - attribute - field - sex - value - M - operator - AND - column - attribute - field - name - value - begins with letter - S - or zero or more characters after the S - condition 2 - column - attribute - field - name - value - begins with letter - A - or zero or more characters after the A - row - record - tuple - value - Alice - included albeit did not satisfy condition 1 - query - OR - condition 2 [1]

```sql
mysql> SELECT name,age
    -> FROM person
    -> WHERE sex="M"
    -> AND name LIKE "S%"
    -> OR name LIKE "A%";
+-------+------+
| name  | age  |
+-------+------+
| Alan  |   12 |
| Shane |   40 |
| Shane |   14 |
| Alice |   24 |
+-------+------+
4 rows in set (0.00 sec)
```

```sql
INTERVAL
BINARY, COLLATE
!
- (unary minus), ~ (unary bit inversion)
^
*, /, DIV, %, MOD
-, +
<<, >>
&
|
= (comparison), <=>, >=, >, <=, <, <>, !=, IS, LIKE, REGEXP, IN, MEMBER OF
BETWEEN, CASE, WHEN, THEN, ELSE
NOT
AND, &&
XOR
OR, ||
= (assignment), :=
```

- using **parentheses** - match any rows - records - tuples - clause - WHERE - condition A - operator - AND - condition B - is met - if condition A is not satisfied then does not matter what condition B is given both conditions must be satisfied [1]

```sql
-- condition A
WHERE sex="M"
```

```sql
-- condition B
AND (name LIKE "S%" OR name LIKE "A%")
```

```sql
mysql> SELECT name,age
    -> FROM person
    -> WHERE sex="M"
    -> AND (name LIKE "S%" OR name LIKE "A%");
+-------+------+
| name  | age  |
+-------+------+
| Alan  |   12 |
| Shane |   40 |
| Shane |   14 |
+-------+------+
3 rows in set (0.00 sec)
```

***
# END